Repository: MoElnaggar14/WeatherAppTask
Catalog: WeatherApp/Core/Localization/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# cities_title
source: Cities
ar: المدن

source: Select an item
ar: اختر عنصراً

source: Unresolved error
ar: خطأ غير محلول

source: WeatherApp
ar: تطبيق الطقس

source: Settings
ar: الإعدادات

source: Appearance
ar: المظهر

source: Language
ar: اللغة

# language_change_note
source: Changing language may require restarting the app
ar: قد يتطلب تغيير اللغة إعادة تشغيل التطبيق

source: Language Changed
ar: تم تغيير اللغة

# language_change_restart_message
source: Please restart the app to apply the new language
ar: يرجى إعادة تشغيل التطبيق لتطبيق اللغة الجديدة

source: System Default
ar: النظام الافتراضي

# light_mode
source: Light
ar: الوضع الفاتح

# dark_mode
source: Dark
ar: الوضع الداكن

source: Search
ar: بحث

source: Searching...
ar: جارٍ البحث...

source: Cancel
ar: إلغاء

source: No Results Found
ar: لم يتم العثور على نتائج

source: Try a different search term
ar: جرب مصطلح بحث مختلف

source: Adding city...
ar: جارٍ إضافة المدينة...

source: Enter city, postcode, or airport location
ar: أدخل اسم المدينة أو الرمز البريدي أو موقع المطار

source: Delete
ar: حذف

source: Delete City
ar: حذف المدينة

# delete_city_confirmation
source: Are you sure you want to delete this city?
ar: هل أنت متأكد أنك تريد حذف هذه المدينة؟

source: View Weather
ar: عرض الطقس

source: No cities added yet
ar: لم تتم إضافة مدن بعد

source: Tap + to add your first city
ar: اضغط على + لإضافة مدينتك الأولى

source: Historical
ar: السجل التاريخي

source: Delete Weather Record
ar: حذف سجل الطقس

# delete_weather_record_confirmation
source: Are you sure you want to delete this weather record?
ar: هل أنت متأكد أنك تريد حذف سجل الطقس هذا؟

source: No Weather History
ar: لا يوجد سجل طقس

source: Weather data will appear here after fetching
ar: ستظهر بيانات الطقس هنا بعد جلبها

# weather_information_for_received_on
source: Weather information for %@
ar: معلومات الطقس لـ %@

source: Loading weather...
ar: جارٍ تحميل الطقس...

source: No Weather Data
ar: لا توجد بيانات طقس

# pull_to_refresh_weather
source: Pull to refresh weather data
ar: اسحب لتحديث بيانات الطقس

source: Refresh
ar: تحديث

source: Failed to add city
ar: فشل في إضافة المدينة
